Infineon/AURIX_code_examples/code_examples/OneEye_UART_Shell_1_KIT_TC375_LK/Libraries/Infra/Sfr/TC37x/IfxSbcu_bf.h
/** \brief Mask for Ifx_SBCU_DBBOST_Bits.FPIRDY */
#define IFX_SBCU_DBBOST_FPIRDY_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_DBBOST_Bits.FPIRDY */
#define IFX_SBCU_DBBOST_FPIRDY_OFF (7u)

/** \brief Length for Ifx_SBCU_DBBOST_Bits.FPIWR */
#define IFX_SBCU_DBBOST_FPIWR_LEN (1u)

/** \brief Mask for Ifx_SBCU_DBBOST_Bits.FPIWR */
#define IFX_SBCU_DBBOST_FPIWR_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_DBBOST_Bits.FPIWR */
#define IFX_SBCU_DBBOST_FPIWR_OFF (8u)

/** \brief Length for Ifx_SBCU_DBBOST_Bits.FPIRST */
#define IFX_SBCU_DBBOST_FPIRST_LEN (2u)

/** \brief Mask for Ifx_SBCU_DBBOST_Bits.FPIRST */
#define IFX_SBCU_DBBOST_FPIRST_MSK (0x3u)

/** \brief Offset for Ifx_SBCU_DBBOST_Bits.FPIRST */
#define IFX_SBCU_DBBOST_FPIRST_OFF (9u)

/** \brief Length for Ifx_SBCU_DBBOST_Bits.FPIOPS */
#define IFX_SBCU_DBBOST_FPIOPS_LEN (1u)

/** \brief Mask for Ifx_SBCU_DBBOST_Bits.FPIOPS */
#define IFX_SBCU_DBBOST_FPIOPS_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_DBBOST_Bits.FPIOPS */
#define IFX_SBCU_DBBOST_FPIOPS_OFF (11u)

/** \brief Length for Ifx_SBCU_DBBOST_Bits.FPIRD */
#define IFX_SBCU_DBBOST_FPIRD_LEN (1u)

/** \brief Mask for Ifx_SBCU_DBBOST_Bits.FPIRD */
#define IFX_SBCU_DBBOST_FPIRD_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_DBBOST_Bits.FPIRD */
#define IFX_SBCU_DBBOST_FPIRD_OFF (12u)

/** \brief Length for Ifx_SBCU_DBBOST_Bits.FPIABORT */
#define IFX_SBCU_DBBOST_FPIABORT_LEN (1u)

/** \brief Mask for Ifx_SBCU_DBBOST_Bits.FPIABORT */
#define IFX_SBCU_DBBOST_FPIABORT_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_DBBOST_Bits.FPIABORT */
#define IFX_SBCU_DBBOST_FPIABORT_OFF (13u)

/** \brief Length for Ifx_SBCU_DBBOST_Bits.FPITOUT */
#define IFX_SBCU_DBBOST_FPITOUT_LEN (1u)

/** \brief Mask for Ifx_SBCU_DBBOST_Bits.FPITOUT */
#define IFX_SBCU_DBBOST_FPITOUT_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_DBBOST_Bits.FPITOUT */
#define IFX_SBCU_DBBOST_FPITOUT_OFF (14u)

/** \brief Length for Ifx_SBCU_DBBOST_Bits.ENDINIT */
#define IFX_SBCU_DBBOST_ENDINIT_LEN (1u)

/** \brief Mask for Ifx_SBCU_DBBOST_Bits.ENDINIT */
#define IFX_SBCU_DBBOST_ENDINIT_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_DBBOST_Bits.ENDINIT */
#define IFX_SBCU_DBBOST_ENDINIT_OFF (15u)

/** \brief Length for Ifx_SBCU_DBBOST_Bits.FPITAG */
#define IFX_SBCU_DBBOST_FPITAG_LEN (6u)

/** \brief Mask for Ifx_SBCU_DBBOST_Bits.FPITAG */
#define IFX_SBCU_DBBOST_FPITAG_MSK (0x3fu)

/** \brief Offset for Ifx_SBCU_DBBOST_Bits.FPITAG */
#define IFX_SBCU_DBBOST_FPITAG_OFF (16u)

/** \brief Length for Ifx_SBCU_DBDAT_Bits.FPIDATA */
#define IFX_SBCU_DBDAT_FPIDATA_LEN (32u)

/** \brief Mask for Ifx_SBCU_DBDAT_Bits.FPIDATA */
#define IFX_SBCU_DBDAT_FPIDATA_MSK (0xffffffffu)

/** \brief Offset for Ifx_SBCU_DBDAT_Bits.FPIDATA */
#define IFX_SBCU_DBDAT_FPIDATA_OFF (0u)

/** \brief Length for Ifx_SBCU_ALSTAT_Bits.AL00 */
#define IFX_SBCU_ALSTAT_AL00_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALSTAT_Bits.AL00 */
#define IFX_SBCU_ALSTAT_AL00_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALSTAT_Bits.AL00 */
#define IFX_SBCU_ALSTAT_AL00_OFF (0u)

/** \brief Length for Ifx_SBCU_ALSTAT_Bits.AL01 */
#define IFX_SBCU_ALSTAT_AL01_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALSTAT_Bits.AL01 */
#define IFX_SBCU_ALSTAT_AL01_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALSTAT_Bits.AL01 */
#define IFX_SBCU_ALSTAT_AL01_OFF (1u)

/** \brief Length for Ifx_SBCU_ALSTAT_Bits.AL02 */
#define IFX_SBCU_ALSTAT_AL02_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALSTAT_Bits.AL02 */
#define IFX_SBCU_ALSTAT_AL02_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALSTAT_Bits.AL02 */
#define IFX_SBCU_ALSTAT_AL02_OFF (2u)

/** \brief Length for Ifx_SBCU_ALSTAT_Bits.AL03 */
#define IFX_SBCU_ALSTAT_AL03_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALSTAT_Bits.AL03 */
#define IFX_SBCU_ALSTAT_AL03_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALSTAT_Bits.AL03 */
#define IFX_SBCU_ALSTAT_AL03_OFF (3u)

/** \brief Length for Ifx_SBCU_ALSTAT_Bits.AL04 */
#define IFX_SBCU_ALSTAT_AL04_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALSTAT_Bits.AL04 */
#define IFX_SBCU_ALSTAT_AL04_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALSTAT_Bits.AL04 */
#define IFX_SBCU_ALSTAT_AL04_OFF (4u)

/** \brief Length for Ifx_SBCU_ALSTAT_Bits.AL05 */
#define IFX_SBCU_ALSTAT_AL05_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALSTAT_Bits.AL05 */
#define IFX_SBCU_ALSTAT_AL05_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALSTAT_Bits.AL05 */
#define IFX_SBCU_ALSTAT_AL05_OFF (5u)

/** \brief Length for Ifx_SBCU_ALSTAT_Bits.AL06 */
#define IFX_SBCU_ALSTAT_AL06_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALSTAT_Bits.AL06 */
#define IFX_SBCU_ALSTAT_AL06_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALSTAT_Bits.AL06 */
#define IFX_SBCU_ALSTAT_AL06_OFF (6u)

/** \brief Length for Ifx_SBCU_ALSTAT_Bits.AL07 */
#define IFX_SBCU_ALSTAT_AL07_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALSTAT_Bits.AL07 */
#define IFX_SBCU_ALSTAT_AL07_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALSTAT_Bits.AL07 */
#define IFX_SBCU_ALSTAT_AL07_OFF (7u)

/** \brief Length for Ifx_SBCU_ALSTAT_Bits.AL08 */
#define IFX_SBCU_ALSTAT_AL08_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALSTAT_Bits.AL08 */
#define IFX_SBCU_ALSTAT_AL08_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALSTAT_Bits.AL08 */
#define IFX_SBCU_ALSTAT_AL08_OFF (8u)

/** \brief Length for Ifx_SBCU_ALSTAT_Bits.AL09 */
#define IFX_SBCU_ALSTAT_AL09_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALSTAT_Bits.AL09 */
#define IFX_SBCU_ALSTAT_AL09_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALSTAT_Bits.AL09 */
#define IFX_SBCU_ALSTAT_AL09_OFF (9u)

/** \brief Length for Ifx_SBCU_ALSTAT_Bits.AL10 */
#define IFX_SBCU_ALSTAT_AL10_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALSTAT_Bits.AL10 */
#define IFX_SBCU_ALSTAT_AL10_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALSTAT_Bits.AL10 */
#define IFX_SBCU_ALSTAT_AL10_OFF (10u)

/** \brief Length for Ifx_SBCU_ALSTAT_Bits.AL11 */
#define IFX_SBCU_ALSTAT_AL11_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALSTAT_Bits.AL11 */
#define IFX_SBCU_ALSTAT_AL11_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALSTAT_Bits.AL11 */
#define IFX_SBCU_ALSTAT_AL11_OFF (11u)

/** \brief Length for Ifx_SBCU_ALSTAT_Bits.AL12 */
#define IFX_SBCU_ALSTAT_AL12_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALSTAT_Bits.AL12 */
#define IFX_SBCU_ALSTAT_AL12_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALSTAT_Bits.AL12 */
#define IFX_SBCU_ALSTAT_AL12_OFF (12u)

