Infineon/AURIX_code_examples/code_examples/OneEye_UART_Shell_1_KIT_TC375_LK/Libraries/Infra/Sfr/TC37x/IfxSbcu_bf.h
/** \brief Length for Ifx_SBCU_ALSTAT_Bits.AL13 */
#define IFX_SBCU_ALSTAT_AL13_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALSTAT_Bits.AL13 */
#define IFX_SBCU_ALSTAT_AL13_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALSTAT_Bits.AL13 */
#define IFX_SBCU_ALSTAT_AL13_OFF (13u)

/** \brief Length for Ifx_SBCU_ALSTAT_Bits.AL14 */
#define IFX_SBCU_ALSTAT_AL14_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALSTAT_Bits.AL14 */
#define IFX_SBCU_ALSTAT_AL14_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALSTAT_Bits.AL14 */
#define IFX_SBCU_ALSTAT_AL14_OFF (14u)

/** \brief Length for Ifx_SBCU_ALSTAT_Bits.AL15 */
#define IFX_SBCU_ALSTAT_AL15_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALSTAT_Bits.AL15 */
#define IFX_SBCU_ALSTAT_AL15_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALSTAT_Bits.AL15 */
#define IFX_SBCU_ALSTAT_AL15_OFF (15u)

/** \brief Length for Ifx_SBCU_ALSTAT_Bits.AL16 */
#define IFX_SBCU_ALSTAT_AL16_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALSTAT_Bits.AL16 */
#define IFX_SBCU_ALSTAT_AL16_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALSTAT_Bits.AL16 */
#define IFX_SBCU_ALSTAT_AL16_OFF (16u)

/** \brief Length for Ifx_SBCU_ALSTAT_Bits.AL17 */
#define IFX_SBCU_ALSTAT_AL17_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALSTAT_Bits.AL17 */
#define IFX_SBCU_ALSTAT_AL17_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALSTAT_Bits.AL17 */
#define IFX_SBCU_ALSTAT_AL17_OFF (17u)

/** \brief Length for Ifx_SBCU_ALSTAT_Bits.AL18 */
#define IFX_SBCU_ALSTAT_AL18_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALSTAT_Bits.AL18 */
#define IFX_SBCU_ALSTAT_AL18_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALSTAT_Bits.AL18 */
#define IFX_SBCU_ALSTAT_AL18_OFF (18u)

/** \brief Length for Ifx_SBCU_ALSTAT_Bits.AL19 */
#define IFX_SBCU_ALSTAT_AL19_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALSTAT_Bits.AL19 */
#define IFX_SBCU_ALSTAT_AL19_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALSTAT_Bits.AL19 */
#define IFX_SBCU_ALSTAT_AL19_OFF (19u)

/** \brief Length for Ifx_SBCU_ALSTAT_Bits.AL20 */
#define IFX_SBCU_ALSTAT_AL20_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALSTAT_Bits.AL20 */
#define IFX_SBCU_ALSTAT_AL20_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALSTAT_Bits.AL20 */
#define IFX_SBCU_ALSTAT_AL20_OFF (20u)

/** \brief Length for Ifx_SBCU_ALSTAT_Bits.AL21 */
#define IFX_SBCU_ALSTAT_AL21_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALSTAT_Bits.AL21 */
#define IFX_SBCU_ALSTAT_AL21_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALSTAT_Bits.AL21 */
#define IFX_SBCU_ALSTAT_AL21_OFF (21u)

/** \brief Length for Ifx_SBCU_ALSTAT_Bits.AL22 */
#define IFX_SBCU_ALSTAT_AL22_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALSTAT_Bits.AL22 */
#define IFX_SBCU_ALSTAT_AL22_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALSTAT_Bits.AL22 */
#define IFX_SBCU_ALSTAT_AL22_OFF (22u)

/** \brief Length for Ifx_SBCU_ALSTAT_Bits.AL23 */
#define IFX_SBCU_ALSTAT_AL23_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALSTAT_Bits.AL23 */
#define IFX_SBCU_ALSTAT_AL23_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALSTAT_Bits.AL23 */
#define IFX_SBCU_ALSTAT_AL23_OFF (23u)

/** \brief Length for Ifx_SBCU_ALSTAT_Bits.AL24 */
#define IFX_SBCU_ALSTAT_AL24_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALSTAT_Bits.AL24 */
#define IFX_SBCU_ALSTAT_AL24_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALSTAT_Bits.AL24 */
#define IFX_SBCU_ALSTAT_AL24_OFF (24u)

/** \brief Length for Ifx_SBCU_ALSTAT_Bits.AL25 */
#define IFX_SBCU_ALSTAT_AL25_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALSTAT_Bits.AL25 */
#define IFX_SBCU_ALSTAT_AL25_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALSTAT_Bits.AL25 */
#define IFX_SBCU_ALSTAT_AL25_OFF (25u)

/** \brief Length for Ifx_SBCU_ALSTAT_Bits.AL26 */
#define IFX_SBCU_ALSTAT_AL26_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALSTAT_Bits.AL26 */
#define IFX_SBCU_ALSTAT_AL26_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALSTAT_Bits.AL26 */
#define IFX_SBCU_ALSTAT_AL26_OFF (26u)

/** \brief Length for Ifx_SBCU_ALSTAT_Bits.AL27 */
#define IFX_SBCU_ALSTAT_AL27_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALSTAT_Bits.AL27 */
#define IFX_SBCU_ALSTAT_AL27_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALSTAT_Bits.AL27 */
#define IFX_SBCU_ALSTAT_AL27_OFF (27u)

/** \brief Length for Ifx_SBCU_ALSTAT_Bits.AL28 */
#define IFX_SBCU_ALSTAT_AL28_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALSTAT_Bits.AL28 */
#define IFX_SBCU_ALSTAT_AL28_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALSTAT_Bits.AL28 */
#define IFX_SBCU_ALSTAT_AL28_OFF (28u)

/** \brief Length for Ifx_SBCU_ALSTAT_Bits.AL29 */
#define IFX_SBCU_ALSTAT_AL29_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALSTAT_Bits.AL29 */
#define IFX_SBCU_ALSTAT_AL29_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALSTAT_Bits.AL29 */
#define IFX_SBCU_ALSTAT_AL29_OFF (29u)

/** \brief Length for Ifx_SBCU_ALSTAT_Bits.AL30 */
#define IFX_SBCU_ALSTAT_AL30_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALSTAT_Bits.AL30 */
#define IFX_SBCU_ALSTAT_AL30_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALSTAT_Bits.AL30 */
#define IFX_SBCU_ALSTAT_AL30_OFF (30u)

/** \brief Length for Ifx_SBCU_ALSTAT_Bits.AL31 */
#define IFX_SBCU_ALSTAT_AL31_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALSTAT_Bits.AL31 */
#define IFX_SBCU_ALSTAT_AL31_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALSTAT_Bits.AL31 */
#define IFX_SBCU_ALSTAT_AL31_OFF (31u)

/** \brief Length for Ifx_SBCU_ALCLR_Bits.CLR00 */
#define IFX_SBCU_ALCLR_CLR00_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALCLR_Bits.CLR00 */
#define IFX_SBCU_ALCLR_CLR00_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALCLR_Bits.CLR00 */
#define IFX_SBCU_ALCLR_CLR00_OFF (0u)

/** \brief Length for Ifx_SBCU_ALCLR_Bits.CLR01 */
#define IFX_SBCU_ALCLR_CLR01_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALCLR_Bits.CLR01 */
#define IFX_SBCU_ALCLR_CLR01_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALCLR_Bits.CLR01 */
#define IFX_SBCU_ALCLR_CLR01_OFF (1u)

/** \brief Length for Ifx_SBCU_ALCLR_Bits.CLR02 */
#define IFX_SBCU_ALCLR_CLR02_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALCLR_Bits.CLR02 */
#define IFX_SBCU_ALCLR_CLR02_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALCLR_Bits.CLR02 */
#define IFX_SBCU_ALCLR_CLR02_OFF (2u)

/** \brief Length for Ifx_SBCU_ALCLR_Bits.CLR03 */
#define IFX_SBCU_ALCLR_CLR03_LEN (1u)

