Infineon/AURIX_code_examples/code_examples/OneEye_UART_Shell_1_KIT_TC375_LK/Libraries/Infra/Sfr/TC37x/IfxSbcu_bf.h
/** \brief Mask for Ifx_SBCU_ALCLR_Bits.CLR03 */
#define IFX_SBCU_ALCLR_CLR03_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALCLR_Bits.CLR03 */
#define IFX_SBCU_ALCLR_CLR03_OFF (3u)

/** \brief Length for Ifx_SBCU_ALCLR_Bits.CLR04 */
#define IFX_SBCU_ALCLR_CLR04_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALCLR_Bits.CLR04 */
#define IFX_SBCU_ALCLR_CLR04_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALCLR_Bits.CLR04 */
#define IFX_SBCU_ALCLR_CLR04_OFF (4u)

/** \brief Length for Ifx_SBCU_ALCLR_Bits.CLR05 */
#define IFX_SBCU_ALCLR_CLR05_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALCLR_Bits.CLR05 */
#define IFX_SBCU_ALCLR_CLR05_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALCLR_Bits.CLR05 */
#define IFX_SBCU_ALCLR_CLR05_OFF (5u)

/** \brief Length for Ifx_SBCU_ALCLR_Bits.CLR06 */
#define IFX_SBCU_ALCLR_CLR06_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALCLR_Bits.CLR06 */
#define IFX_SBCU_ALCLR_CLR06_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALCLR_Bits.CLR06 */
#define IFX_SBCU_ALCLR_CLR06_OFF (6u)

/** \brief Length for Ifx_SBCU_ALCLR_Bits.CLR07 */
#define IFX_SBCU_ALCLR_CLR07_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALCLR_Bits.CLR07 */
#define IFX_SBCU_ALCLR_CLR07_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALCLR_Bits.CLR07 */
#define IFX_SBCU_ALCLR_CLR07_OFF (7u)

/** \brief Length for Ifx_SBCU_ALCLR_Bits.CLR08 */
#define IFX_SBCU_ALCLR_CLR08_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALCLR_Bits.CLR08 */
#define IFX_SBCU_ALCLR_CLR08_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALCLR_Bits.CLR08 */
#define IFX_SBCU_ALCLR_CLR08_OFF (8u)

/** \brief Length for Ifx_SBCU_ALCLR_Bits.CLR09 */
#define IFX_SBCU_ALCLR_CLR09_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALCLR_Bits.CLR09 */
#define IFX_SBCU_ALCLR_CLR09_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALCLR_Bits.CLR09 */
#define IFX_SBCU_ALCLR_CLR09_OFF (9u)

/** \brief Length for Ifx_SBCU_ALCLR_Bits.CLR10 */
#define IFX_SBCU_ALCLR_CLR10_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALCLR_Bits.CLR10 */
#define IFX_SBCU_ALCLR_CLR10_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALCLR_Bits.CLR10 */
#define IFX_SBCU_ALCLR_CLR10_OFF (10u)

/** \brief Length for Ifx_SBCU_ALCLR_Bits.CLR11 */
#define IFX_SBCU_ALCLR_CLR11_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALCLR_Bits.CLR11 */
#define IFX_SBCU_ALCLR_CLR11_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALCLR_Bits.CLR11 */
#define IFX_SBCU_ALCLR_CLR11_OFF (11u)

/** \brief Length for Ifx_SBCU_ALCLR_Bits.CLR12 */
#define IFX_SBCU_ALCLR_CLR12_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALCLR_Bits.CLR12 */
#define IFX_SBCU_ALCLR_CLR12_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALCLR_Bits.CLR12 */
#define IFX_SBCU_ALCLR_CLR12_OFF (12u)

/** \brief Length for Ifx_SBCU_ALCLR_Bits.CLR13 */
#define IFX_SBCU_ALCLR_CLR13_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALCLR_Bits.CLR13 */
#define IFX_SBCU_ALCLR_CLR13_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALCLR_Bits.CLR13 */
#define IFX_SBCU_ALCLR_CLR13_OFF (13u)

/** \brief Length for Ifx_SBCU_ALCLR_Bits.CLR14 */
#define IFX_SBCU_ALCLR_CLR14_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALCLR_Bits.CLR14 */
#define IFX_SBCU_ALCLR_CLR14_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALCLR_Bits.CLR14 */
#define IFX_SBCU_ALCLR_CLR14_OFF (14u)

/** \brief Length for Ifx_SBCU_ALCLR_Bits.CLR15 */
#define IFX_SBCU_ALCLR_CLR15_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALCLR_Bits.CLR15 */
#define IFX_SBCU_ALCLR_CLR15_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALCLR_Bits.CLR15 */
#define IFX_SBCU_ALCLR_CLR15_OFF (15u)

/** \brief Length for Ifx_SBCU_ALCLR_Bits.CLR16 */
#define IFX_SBCU_ALCLR_CLR16_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALCLR_Bits.CLR16 */
#define IFX_SBCU_ALCLR_CLR16_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALCLR_Bits.CLR16 */
#define IFX_SBCU_ALCLR_CLR16_OFF (16u)

/** \brief Length for Ifx_SBCU_ALCLR_Bits.CLR17 */
#define IFX_SBCU_ALCLR_CLR17_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALCLR_Bits.CLR17 */
#define IFX_SBCU_ALCLR_CLR17_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALCLR_Bits.CLR17 */
#define IFX_SBCU_ALCLR_CLR17_OFF (17u)

/** \brief Length for Ifx_SBCU_ALCLR_Bits.CLR18 */
#define IFX_SBCU_ALCLR_CLR18_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALCLR_Bits.CLR18 */
#define IFX_SBCU_ALCLR_CLR18_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALCLR_Bits.CLR18 */
#define IFX_SBCU_ALCLR_CLR18_OFF (18u)

/** \brief Length for Ifx_SBCU_ALCLR_Bits.CLR19 */
#define IFX_SBCU_ALCLR_CLR19_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALCLR_Bits.CLR19 */
#define IFX_SBCU_ALCLR_CLR19_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALCLR_Bits.CLR19 */
#define IFX_SBCU_ALCLR_CLR19_OFF (19u)

/** \brief Length for Ifx_SBCU_ALCLR_Bits.CLR20 */
#define IFX_SBCU_ALCLR_CLR20_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALCLR_Bits.CLR20 */
#define IFX_SBCU_ALCLR_CLR20_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALCLR_Bits.CLR20 */
#define IFX_SBCU_ALCLR_CLR20_OFF (20u)

/** \brief Length for Ifx_SBCU_ALCLR_Bits.CLR21 */
#define IFX_SBCU_ALCLR_CLR21_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALCLR_Bits.CLR21 */
#define IFX_SBCU_ALCLR_CLR21_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALCLR_Bits.CLR21 */
#define IFX_SBCU_ALCLR_CLR21_OFF (21u)

/** \brief Length for Ifx_SBCU_ALCLR_Bits.CLR22 */
#define IFX_SBCU_ALCLR_CLR22_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALCLR_Bits.CLR22 */
#define IFX_SBCU_ALCLR_CLR22_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALCLR_Bits.CLR22 */
#define IFX_SBCU_ALCLR_CLR22_OFF (22u)

/** \brief Length for Ifx_SBCU_ALCLR_Bits.CLR23 */
#define IFX_SBCU_ALCLR_CLR23_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALCLR_Bits.CLR23 */
#define IFX_SBCU_ALCLR_CLR23_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALCLR_Bits.CLR23 */
#define IFX_SBCU_ALCLR_CLR23_OFF (23u)

/** \brief Length for Ifx_SBCU_ALCLR_Bits.CLR24 */
#define IFX_SBCU_ALCLR_CLR24_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALCLR_Bits.CLR24 */
#define IFX_SBCU_ALCLR_CLR24_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALCLR_Bits.CLR24 */
#define IFX_SBCU_ALCLR_CLR24_OFF (24u)

/** \brief Length for Ifx_SBCU_ALCLR_Bits.CLR25 */
#define IFX_SBCU_ALCLR_CLR25_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALCLR_Bits.CLR25 */
#define IFX_SBCU_ALCLR_CLR25_MSK (0x1u)

